{
  "POTATOES": {
    "ENG": {
      "SOIL": "Ideal soil type: \n Potatoes thrive in loose, well-drained, fertile soil with slightly acidic pH (5.5-6.5). Heavy clay soils retain too much water and hinder tuber development, so they are unsuitable for potato cultivation. To improve drainage in clay soils, consider incorporating organic matter like compost or aged manure, or raised bed planting. \n Tilling: \n Deeply till the soil (around 30 cm depth) to break up compaction and improve drainage. This allows for better root growth, water infiltration, and oxygen exchange in the soil, all crucial for healthy potato plant development. \nAmendments: Incorporate compost or well-rotted manure to enhance soil fertility and structure. Compost adds organic matter that improves water retention, aeration, and nutrient availability for the plants. A soil test can help determine if lime is needed to adjust soil pH to the slightly acidic range preferred by potatoes.",
      "PLANTING": "Seed potatoes: \n Begin with certified, disease-free seed potatoes for best results. Sprouting the seed potatoes in a cool, well-lit location for a few weeks before planting encourages strong sprout development and leads to more vigorous potato plants.\n Spacing: \n Maintain a 60 cm distance between rows and 25 cm between plants. This spacing ensures good air circulation and minimizes disease spread. Planting too close together can restrict airflow and create humid conditions that favor fungal diseases.\n Planting method: \n Plant potatoes in ridges or raised beds for improved drainage. Ridges and raised beds help prevent waterlogging around the tubers, which can lead to rot. They can also be beneficial in areas with heavy rainfall",
      "FERTILIZING": "Fertilizer types: \n Use a balanced fertilizer with NPK (nitrogen, phosphorus, potassium) tailored for potato cultivation. Nitrogen promotes vegetative growth, phosphorus is important for root development and tuber bulking, and potassium helps with overall plant health and disease resistance. Consult the Department of Agriculture or local agricultural extension officers for specific recommendations based on your region and soil type. A soil test can also provide valuable insights into nutrient levels and potential deficiencies. \nApplication: Apply basal fertilizer at planting, followed by top dressings according to potato growth stages. Basal fertilizer provides a readily available source of nutrients for young plants to establish themselves. Top dressings during the growing season can supplement nutrients as the plants mature and tuber formation progresses. Be mindful to avoid overfertilization, which can harm plants and contribute to environmental pollution.",
      "RECOMMEND": "Popular varieties:\n Some well-suited potato varieties for Sri Lanka include 'Granola', 'Red Pontiac', 'Desiree', and 'Kennebec'. These varieties offer a combination of desirable traits such as good yield potential, disease resistance, and adaptation to Sri Lankan growing conditions.\nRegional suitability:\n Consult with the Department of Agriculture or your local agricultural extension officers for the best varieties for your specific region and growing season. Different potato varieties have varying maturity dates, heat tolerance, and disease resistance. Choosing varieties suited to your local climate and conditions will optimize your potato growing success.",
      "DISEASES": "Common diseases: \n Watch out for late blight, early blight, bacterial wilt, and viral diseases. Look up pictures and descriptions to correctly identify diseases. Early detection and identification are crucial for taking timely management actions.\nPreventive measures: \n Practice crop rotation, use resistant varieties, and maintain good field hygiene to minimize disease risks. Crop rotation disrupts disease cycles and helps reduce disease buildup in the soil. Planting resistant varieties minimizes the chance of infection. Good field hygiene practices like removing plant debris and weeds after harvest can help reduce disease inoculum and harboring sites for pests.\n Chemical control: \n If necessary, use recommended fungicides or pesticides judiciously. Follow instructions carefully and always prioritize Integrated Pest Management (IPM) approaches. IPM combines various methods to manage pests, minimizing reliance on chemical controls and promoting a more sustainable approach.\n",
      "HARVESTING": "Maturity: \n Potatoes are typically ready for harvest 3-4 months after planting. Yellowing leaves and dying stems are signs of maturity.\nHaulm removal: \n Cut off the potato stems (haulms) a couple of weeks before harvest to encourage tubers to mature and develop thicker skins. This improves tuber quality and storability.\nCareful Harvesting: \n Dig up potatoes carefully to avoid damaging the tubers. Bruised or damaged potatoes are more susceptible to spoilage during storage."
    },
    "SIN": {
      "SOIL": "කදිම පාංශු වර්ගය: \nතරමක් ආම්ලික pH (5.5-6.5) සහිත ලිහිල්, හොඳින් ජලය බැස යන, සාරවත් පසෙහි අර්තාපල් වර්ධනය වේ. අධික මැටි පස්වල ජලය අධික ලෙස රඳවා තබාගෙන අල වර්ධනයට බාධාවක් වන බැවින් ඒවා අල වගාවට නුසුදුසුය. මැටි පසෙහි ජලාපවහනය වැඩි දියුණු කිරීම සඳහා, කොම්පෝස්ට් හෝ වයස්ගත පොහොර, හෝ උස් ඇඳන් සිටුවීම වැනි කාබනික ද්රව්ය ඇතුළත් කිරීම සලකා බලන්න.\n කැටයම් කිරීම: \n ඝනත්වය බිඳ දැමීම සහ ජලාපවහනය වැඩි දියුණු කිරීම සඳහා ගැඹුරට පස (සෙ.මී. 30 ක් පමණ ගැඹුර) දක්වා. මෙය වඩා හොඳ මුල් වර්ධනයක්, ජලය කාන්දු වීම සහ පසෙහි ඔක්සිජන් හුවමාරුව සඳහා ඉඩ සලසයි, සෞඛ්ය සම්පන්න අර්තාපල් ශාක සංවර්ධනය සඳහා ඉතා වැදගත් වේ.සංශෝධන: පාංශු සාරවත් බව සහ ව්යුහය වැඩි දියුණු කිරීම සඳහා කොම්පෝස්ට් හෝ හොඳින් කුණු වූ පොහොර ඇතුළත් කරන්න. කොම්පෝස්ට් කාබනික ද්රව්ය එකතු කරන අතර එමඟින් ශාක සඳහා ජලය රඳවා තබා ගැනීම, වාතනය සහ පෝෂක ලබා ගැනීමේ හැකියාව වැඩි දියුණු කරයි. අර්තාපල් කැමති තරමක් ආම්ලික පරාසයට පාංශු pH අගය සකස් කිරීමට දෙහි අවශ්ය දැයි පාංශු පරීක්ෂණයකින් තීරණය කළ හැක",
      "PLANTING": "බීජ අර්තාපල්: \nහොඳම ප්රතිඵල සඳහා සහතික කළ, රෝග-නිදහස් බීජ අර්තාපල් සමඟ ආරම්භ කරන්න. සිටුවීමට පෙර සති කිහිපයක් සිසිල්, හොඳින් ආලෝකමත් ස්ථානයක බීජ අර්තාපල් පැළ කිරීම ශක්තිමත් පැළ වර්ධනයට දිරිගන්වන අතර වඩාත් ශක්තිමත් අර්තාපල් පැල ඇති කරයි. \nපරතරය:\n පේළි අතර සෙන්ටිමීටර 60 ක් සහ පැල අතර සෙන්ටිමීටර 25 ක දුරක් පවත්වා ගන්න. මෙම පරතරය හොඳ වායු සංසරණය සහතික කරන අතර රෝග පැතිරීම අවම කරයි. ඉතා සමීපව සිටුවීමෙන් වාතය ගලායාම සීමා කළ හැකි අතර දිලීර රෝග සඳහා අනුග්රහය දක්වන තෙත් තත්වයන් නිර්මාණය කළ හැකිය.\n රෝපණ ක්රමය: \n ජලාපවහනය වැඩි දියුණු කිරීම සඳහා කඳු වැටි හෝ උස් පාත්තිවල අර්තාපල් සිටුවන්න. වැටි සහ උස් පාත්ති අල වටා ජලයෙන් යටවීම වැළැක්වීමට උපකාරී වන අතර එය කුණුවීමට හේතු වේ. අධික වර්ෂාපතනයක් ඇති ප්රදේශ වලද ඒවා ප්රයෝජනවත් විය හැකිය.",
      "FERTILIZING": "පොහොර වර්ග: \nඅර්තාපල් වගාව සඳහා සකස් කරන ලද NPK (නයිට්රජන්, පොස්පරස්, පොටෑසියම්) සමඟ සමතුලිත පොහොර භාවිතා කරන්න. නයිට්රජන් වෘක්ෂලතා වර්ධනය ප්රවර්ධනය කරයි, පොස්පරස් මූල සංවර්ධනයට සහ අල ගොඩගැසීමට වැදගත් වන අතර පොටෑසියම් සමස්ත ශාක සෞඛ්යයට සහ රෝග ප්රතිරෝධයට උපකාරී වේ. ඔබේ කලාපය සහ පාංශු වර්ගය මත පදනම්ව නිශ්චිත නිර්දේශ සඳහා කෘෂිකර්ම දෙපාර්තමේන්තුව හෝ ප්රාදේශීය කෘෂිකර්ම ව්යාප්ති නිලධාරීන්ගෙන් විමසන්න. පාංශු පරීක්ෂාවකින් පෝෂක මට්ටම් සහ විභව ඌනතා පිළිබඳ වටිනා අවබෝධයක් ද ලබා දිය හැක.\nයෙදුම: \n සිටුවීමේදී බාසල් පොහොර යොදන්න, පසුව අර්තාපල් වර්ධන අවධීන් අනුව ඉහළ පොහොර යොදන්න. බාසල් පොහොර තරුණ ශාක සඳහා පහසුවෙන් ලබා ගත හැකි පෝෂ්ය පදාර්ථ ප්රභවයක් සපයයි. වැඩෙන සමයේදී ඉහළ ඇඳුම් ඇඳීම, ශාක පරිණත වන විට සහ අල සෑදීමේ ප්රගතියත් සමඟ පෝෂ්ය පදාර්ථ අතිරේක කළ හැකිය. ශාකවලට හානි කළ හැකි සහ පරිසර දූෂණයට දායක වන අධික පොහොර යෙදීමෙන් වැළකී සිටීමට සැලකිලිමත් වන්න.",
      "RECOMMEND": "ජනප්රිය ප්රභේද: \nශ්රී ලංකාවට හොඳින් ගැළපෙන සමහර අර්තාපල් ප්රභේද අතර 'Granola', 'Red Pontiac', 'Desiree' සහ 'Kennebec' ඇතුළත් වේ. මෙම ප්රභේද මඟින් හොඳ අස්වැන්නක් ලබා ගැනීමේ හැකියාව, රෝග ප්රතිරෝධය සහ ශ්රී ලංකාවේ වර්ධනය වන තත්ත්වයන්ට අනුවර්තනය වීම වැනි යෝග්ය ගතිලක්ෂණවල එකතුවක් ඉදිරිපත් කරයි.\nකලාපීය යෝග්යතාවය:\n ඔබේ නිශ්චිත කලාපයට සහ වැඩෙන සමය සඳහා හොඳම ප්රභේද සඳහා කෘෂිකර්ම දෙපාර්තමේන්තුව හෝ ඔබේ ප්රාදේශීය කෘෂි ව්යාප්ති නිලධාරීන් සමඟ සාකච්ඡා කරන්න. විවිධ අල වර්ගවල පරිණත දිනයන්, තාපයට ඔරොත්තු දීමේ හැකියාව සහ රෝග ප්රතිරෝධය වෙනස් වේ. ඔබගේ දේශීය දේශගුණයට සහ තත්ත්වයට ගැලපෙන ප්රභේද තෝරා ගැනීම ඔබේ අර්තාපල් වගාවේ සාර්ථකත්වය ප්රශස්ත කරයි.",
      "DISEASES": "පොදු රෝග: \n ප්රමාද අංගමාරය, මුල් අංගමාරය, බැක්ටීරියා මැලවීම සහ වෛරස් රෝග ගැන විමසිලිමත් වන්න. රෝග නිවැරදිව හඳුනා ගැනීමට පින්තූර සහ විස්තර බලන්න. කාලෝචිත කළමනාකරණ ක්රියාමාර්ග ගැනීම සඳහා කල්තියා හඳුනා ගැනීම සහ හඳුනා ගැනීම ඉතා වැදගත් වේ.\nවැලැක්වීමේ පියවර: \n රෝග අවදානම අවම කිරීම සඳහා බෝග මාරු කිරීම, ප්රතිරෝධී ප්රභේද භාවිතා කිරීම සහ හොඳ ක්ෂේත්ර සනීපාරක්ෂාව පවත්වා ගැනීම. බෝග භ්රමණය රෝග චක්ර කඩාකප්පල් කරන අතර පසෙහි රෝග ගොඩනැගීම අඩු කිරීමට උපකාරී වේ. ප්රතිරෝධී ප්රභේද සිටුවීමෙන් ආසාදනය වීමේ සම්භාවිතාව අවම වේ. අස්වැන්න නෙලීමෙන් පසු ශාක සුන්බුන් සහ වල් පැලෑටි ඉවත් කිරීම වැනි හොඳ ක්ෂේත්ර සනීපාරක්ෂක පිළිවෙත් මගින් රෝග එන්නත් සහ පළිබෝධකයන් සඳහා ස්ථානගත වීම අඩු කිරීමට උපකාරී වේ.\nරසායනික පාලනය: \n අවශ්ය නම්, නිර්දේශිත දිලීර නාශක හෝ පළිබෝධනාශක කල්පනාකාරීව භාවිතා කරන්න. උපදෙස් ප්රවේශමෙන් අනුගමනය කරන්න සහ සෑම විටම ඒකාබද්ධ පළිබෝධ කළමනාකරණ (IPM) ප්රවේශයන්ට ප්රමුඛත්වය දෙන්න. IPM පළිබෝධ පාලනය කිරීමට විවිධ ක්රම ඒකාබද්ධ කරයි, රසායනික පාලනයන් මත යැපීම අවම කරයි සහ වඩාත් තිරසාර ප්රවේශයක් ප්රවර්ධනය කරයි.",
      "HARVESTING": "පරිණතභාවය: \n අර්තාපල් සාමාන්යයෙන් සිටුවීමෙන් මාස 3-4 කට පසු අස්වැන්න සඳහා සූදානම් වේ. කොළ කහ වීම සහ කඳන් මිය යාම පරිණතභාවයේ ලක්ෂණ වේ.\nහාල් ඉවත් කිරීම: \n අල ඉදවීමට සහ ඝන සම වර්ධනය කිරීමට දිරිගැන්වීම සඳහා අස්වැන්න නෙළීමට සති කිහිපයකට පෙර අර්තාපල් කඳන් (හෝල්ම්ස්) කපා දමන්න. මෙය අල වල ගුණාත්මකභාවය සහ ගබඩා කිරීමේ හැකියාව වැඩි දියුණු කරයි.\nප්රවේශමෙන් අස්වනු නෙලීම: \n අල වලට හානි නොවන පරිදි ප්රවේශමෙන් අර්තාපල් හාරන්න. තැළුණු හෝ හානියට පත් අර්තාපල් ගබඩා කිරීමේදී නරක් වීමට වැඩි අවදානමක් ඇත."
    },
    "TAM": {
      "SOIL": "உகந்த மண் வகை:\nஉருளைக்கிழங்குகள் தளர்வான, நன்கு வடிகட்டிய, வளமான மண்ணில் சற்று அமிலத்தன்மை கொண்ட pH (5.5-6.5) உடன் செழித்து வளரும். கனமான களிமண் மண் அதிக தண்ணீரைத் தக்கவைத்து, கிழங்கு வளர்ச்சியைத் தடுக்கிறது, எனவே அவை உருளைக்கிழங்கு சாகுபடிக்கு பொருந்தாது. களிமண் மண்ணில் வடிகால் வசதியை மேம்படுத்த, உரம் அல்லது வயதான எரு, அல்லது உயர்த்தப்பட்ட பாத்திகள் போன்ற கரிமப் பொருட்களைச் சேர்த்துக் கொள்ள வேண்டும். உழவு: மண்ணை ஆழமாக வரைந்து (சுமார் 30 செ.மீ. ஆழம்) சுருக்கத்தை உடைத்து வடிகால் மேம்படுத்தவும். இது சிறந்த வேர் வளர்ச்சி, நீர் ஊடுருவல் மற்றும் மண்ணில் ஆக்ஸிஜன் பரிமாற்றம் ஆகியவற்றை அனுமதிக்கிறது, இவை அனைத்தும் ஆரோக்கியமான உருளைக்கிழங்கு தாவர வளர்ச்சிக்கு முக்கியமானவை. திருத்தங்கள்: மண்ணின் வளம் மற்றும் கட்டமைப்பை மேம்படுத்துவதற்கு உரம் அல்லது நன்கு அழுகிய எருவை இணைக்கவும். உரம் கரிமப் பொருட்களைச் சேர்க்கிறது, இது தாவரங்களுக்கு நீர் தேக்கம், காற்றோட்டம் மற்றும் ஊட்டச்சத்து கிடைப்பதை மேம்படுத்துகிறது. உருளைக்கிழங்கு விரும்பப்படும் சற்று அமிலத்தன்மைக்கு மண்ணின் pH ஐ சரிசெய்ய சுண்ணாம்பு தேவையா என்பதை மண் பரிசோதனை தீர்மானிக்க உதவும்.",
      "PLANTING": "விதை உருளைக்கிழங்கு: \nசிறந்த முடிவுகளுக்கு சான்றளிக்கப்பட்ட, நோய் இல்லாத விதை உருளைக்கிழங்குடன் தொடங்குங்கள். விதை உருளைக்கிழங்கை நடவு செய்வதற்கு சில வாரங்களுக்கு முன் குளிர்ந்த, நன்கு ஒளிரும் இடத்தில் முளைப்பது வலுவான முளை வளர்ச்சியை ஊக்குவிக்கிறது மற்றும் அதிக வீரியமுள்ள உருளைக்கிழங்கு செடிகளுக்கு வழிவகுக்கிறது. இடைவெளி: வரிசைகளுக்கு இடையே 60 செ.மீ தூரமும், செடிகளுக்கு இடையே 25 செ.மீ தூரமும் பராமரிக்கவும். இந்த இடைவெளி நல்ல காற்று சுழற்சியை உறுதிசெய்து நோய் பரவலைக் குறைக்கிறது. மிக நெருக்கமாக நடவு செய்வது காற்றோட்டத்தை கட்டுப்படுத்துகிறது மற்றும் பூஞ்சை நோய்களுக்கு சாதகமான ஈரப்பதமான நிலைமைகளை உருவாக்குகிறது. நடவு முறை: உருளைக்கிழங்கை மேடுகளில் அல்லது உயர்த்தப்பட்ட பாத்திகளில் வடிகால் வசதியை மேம்படுத்தவும். கிழங்குகளைச் சுற்றி நீர் தேங்குவதைத் தடுக்க முகடுகளும் உயர்த்தப்பட்ட படுக்கைகளும் உதவுகின்றன, இது அழுகுவதற்கு வழிவகுக்கும். அதிக மழை பெய்யும் பகுதிகளிலும் அவை பயனுள்ளதாக இருக்கும்.",
      "FERTILIZING": "உர வகைகள்: \nஉருளைக்கிழங்கு சாகுபடிக்கு ஏற்றவாறு NPK (நைட்ரஜன், பாஸ்பரஸ், பொட்டாசியம்) கொண்ட சமச்சீர் உரத்தைப் பயன்படுத்தவும். நைட்ரஜன் தாவர வளர்ச்சியை ஊக்குவிக்கிறது, பாஸ்பரஸ் வேர் வளர்ச்சி மற்றும் கிழங்கு பெருக்கத்திற்கு முக்கியமானது, மேலும் பொட்டாசியம் ஒட்டுமொத்த தாவர ஆரோக்கியத்திற்கும் நோய் எதிர்ப்புக்கும் உதவுகிறது. உங்கள் பகுதி மற்றும் மண்ணின் வகையின் அடிப்படையில் குறிப்பிட்ட பரிந்துரைகளுக்கு வேளாண்மைத் துறை அல்லது உள்ளூர் வேளாண் விரிவாக்க அலுவலர்களை அணுகவும். ஒரு மண் பரிசோதனையானது ஊட்டச்சத்து அளவுகள் மற்றும் சாத்தியமான குறைபாடுகள் பற்றிய மதிப்புமிக்க நுண்ணறிவுகளை வழங்க முடியும். பயன்பாடு: உருளைக்கிழங்கு வளர்ச்சி நிலைகளுக்கு ஏற்ப அடியுர உரங்களை நடவு செய்து, மேல் உரமிடவும். இளம் தாவரங்கள் தங்களை நிலைநிறுத்திக் கொள்வதற்கு அடிப்படை உரங்கள் எளிதில் கிடைக்கக்கூடிய ஊட்டச்சத்துக்களை வழங்குகிறது. வளரும் பருவத்தில் மேல் உரமிடுதல் தாவரங்கள் முதிர்ச்சியடையும் மற்றும் கிழங்கு உருவாக்கம் முன்னேறும் போது ஊட்டச்சத்துக்களை நிரப்பலாம். அதிகப்படியான உரமிடுவதைத் தவிர்க்க கவனமாக இருங்கள், இது தாவரங்களுக்கு தீங்கு விளைவிக்கும் மற்றும் சுற்றுச்சூழல் மாசுபாட்டிற்கு பங்களிக்கும்.",
      "RECOMMEND": "பிரபலமான வகைகள்: \nஇலங்கைக்கு மிகவும் பொருத்தமான சில உருளைக்கிழங்கு வகைகளில் 'கிரானோலா', 'ரெட் போண்டியாக்', 'டிசைரி' மற்றும் 'கென்னபெக்' ஆகியவை அடங்கும். இந்த வகைகள் நல்ல மகசூல் திறன், நோய் எதிர்ப்பு சக்தி மற்றும் இலங்கையின் வளரும் நிலைமைகளுக்கு ஏற்றவாறு விரும்பத்தக்க பண்புகளின் கலவையை வழங்குகின்றன.\nபிராந்திய பொருத்தம்: உங்கள் குறிப்பிட்ட பகுதி மற்றும் வளரும் பருவத்திற்கான சிறந்த ரகங்களுக்கு வேளாண்மைத் துறை அல்லது உங்கள் உள்ளூர் வேளாண் விரிவாக்க அலுவலர்களுடன் கலந்தாலோசிக்கவும். வெவ்வேறு உருளைக்கிழங்கு வகைகள் மாறுபட்ட முதிர்வு தேதிகள், வெப்பத்தை தாங்கும் திறன் மற்றும் நோய் எதிர்ப்பு சக்தி ஆகியவற்றைக் கொண்டுள்ளன. உங்கள் உள்ளூர் காலநிலை மற்றும் நிலைமைகளுக்கு ஏற்ற வகைகளைத் தேர்ந்தெடுப்பது உங்கள் உருளைக்கிழங்கு வளரும் வெற்றியை மேம்படுத்தும்.\n",
      "DISEASES": "உகந்த மண் வகை: \nஉருளைக்கிழங்குகள் தளர்வான, நன்கு வடிகட்டிய, வளமான மண்ணில் சற்று அமிலத்தன்மை கொண்ட pH (5.5-6.5) உடன் செழித்து வளரும். கனமான களிமண் மண் அதிக தண்ணீரைத் தக்கவைத்து, கிழங்கு வளர்ச்சியைத் தடுக்கிறது, எனவே அவை உருளைக்கிழங்கு சாகுபடிக்கு பொருந்தாது. களிமண் மண்ணில் வடிகால் வசதியை மேம்படுத்த, உரம் அல்லது வயதான எரு, அல்லது உயர்த்தப்பட்ட பாத்திகள் போன்ற கரிமப் பொருட்களைச் சேர்த்துக் கொள்ள வேண்டும்.\nஉழவு: மண்ணை ஆழமாக வரைந்து (சுமார் 30 செ.மீ. ஆழம்) சுருக்கத்தை உடைத்து வடிகால் மேம்படுத்தவும். இது சிறந்த வேர் வளர்ச்சி, நீர் ஊடுருவல் மற்றும் மண்ணில் ஆக்ஸிஜன் பரிமாற்றம் ஆகியவற்றை அனுமதிக்கிறது, இவை அனைத்தும் ஆரோக்கியமான உருளைக்கிழங்கு தாவர வளர்ச்சிக்கு முக்கியமானவை.\nதிருத்தங்கள்: மண்ணின் வளம் மற்றும் கட்டமைப்பை மேம்படுத்துவதற்கு உரம் அல்லது நன்கு அழுகிய எருவை இணைக்கவும். உரம் கரிமப் பொருட்களைச் சேர்க்கிறது, இது தாவரங்களுக்கு நீர் தேக்கம், காற்றோட்டம் மற்றும் ஊட்டச்சத்து கிடைப்பதை மேம்படுத்துகிறது. உருளைக்கிழங்கு விரும்பப்படும் சற்று அமிலத்தன்மைக்கு மண்ணின் pH ஐ சரிசெய்ய சுண்ணாம்பு தேவையா என்பதை மண் பரிசோதனை தீர்மானிக்க உதவும்.",
      "HARVESTING": "உர வகைகள்: \nஉருளைக்கிழங்கு சாகுபடிக்கு ஏற்றவாறு NPK (நைட்ரஜன், பாஸ்பரஸ், பொட்டாசியம்) கொண்ட சமச்சீர் உரத்தைப் பயன்படுத்தவும். நைட்ரஜன் தாவர வளர்ச்சியை ஊக்குவிக்கிறது, பாஸ்பரஸ் வேர் வளர்ச்சி மற்றும் கிழங்கு பெருக்கத்திற்கு முக்கியமானது, மேலும் பொட்டாசியம் ஒட்டுமொத்த தாவர ஆரோக்கியத்திற்கும் நோய் எதிர்ப்புக்கும் உதவுகிறது. உங்கள் பகுதி மற்றும் மண்ணின் வகையின் அடிப்படையில் குறிப்பிட்ட பரிந்துரைகளுக்கு வேளாண்மைத் துறை அல்லது உள்ளூர் வேளாண் விரிவாக்க அலுவலர்களை அணுகவும். ஒரு மண் பரிசோதனையானது ஊட்டச்சத்து அளவுகள் மற்றும் சாத்தியமான குறைபாடுகள் பற்றிய மதிப்புமிக்க நுண்ணறிவுகளை வழங்க முடியும்."
    }
  },
  "CARROT": {
    "ENG": {
      "SOIL": "Ideal soil type: \n Potatoes thrive in loose, well-drained, fertile soil with slightly acidic pH (5.5-6.5). Heavy clay soils retain too much water and hinder tuber development, so they are unsuitable for potato cultivation. To improve drainage in clay soils, consider incorporating organic matter like compost or aged manure, or raised bed planting. \n Tilling: \n Deeply till the soil (around 30 cm depth) to break up compaction and improve drainage. This allows for better root growth, water infiltration, and oxygen exchange in the soil, all crucial for healthy potato plant development. \nAmendments: \n Incorporate compost or well-rotted manure to enhance soil fertility and structure. Compost adds organic matter that improves water retention, aeration, and nutrient availability for the plants. A soil test can help determine if lime is needed to adjust soil pH to the slightly acidic range preferred by potatoes.",
      "PLANTING": "Seed selection: \n Choose high-quality carrot seeds suited for the Sri Lankan climate. Popular varieties include 'New Kuroda', 'Nantes', and other locally adapted types. Obtain seeds from reliable sources like the Department of Agriculture or reputable seed suppliers. Seed rate: The typical seed rate for carrots is approximately 4 kg per hectare. \nPlanting method: \n Direct sowing is the preferred method for carrots. Sow seeds in rows on raised beds, maintaining a row spacing of about 25 cm. Carefully thin seedlings later to a spacing of 5-8 cm within each row to allow adequate space for root development.",
      "FERTILIZING": "Basal fertilizer: \n Incorporate well-rotted compost or manure (around 10 tons per hectare) into the soil before planting. Apply a balanced basal fertilizer mixture like TSP (Triple Superphosphate) and MOP (Muriate of Potash). Consult the Department of Agriculture (http://www.doa.gov.lk/) for specific fertilizer recommendations based on your soil test results and region.\n Top dressing: \n Split nitrogen fertilizer applications into several top dressings throughout the growing season for optimal nutrient uptake. A typical top-dressing schedule might involve applications at 3, 6, 8, and 9 weeks after planting. Follow the recommendations provided by agricultural authorities for your specific location.",
      "RECOMMEND": "Popular varieties: Some well-adapted carrot varieties for Sri Lanka include 'New Kuroda', 'Nantes', 'Chantenay', and 'Danvers'. These varieties are known for their good yield potential, disease resistance, and suitability to Sri Lankan growing conditions.\nRegional recommendations: Consult with the Department of Agriculture or your local agricultural extension officers for the best carrot varieties recommended for your particular region and growing season.",
      "DISEASES": "Common diseases: \n Watch out for fungal diseases like Alternaria leaf blight, Cercospora leaf spot, powdery mildew, and root rot diseases. Bacterial diseases like bacterial soft rot can also affect carrots. Practice good cultural practices such as crop rotation and proper sanitation to minimize disease risks.\nPests: \n Monitor for pests like aphids, carrot flies, cutworms, and nematodes. Implement Integrated Pest Management (IPM) strategies that combine cultural, biological, and chemical control methods for effective pest management.\nChemical control: \n If necessary, use recommended fungicides or insecticides judiciously according to instructions. Always prioritize IPM approaches to reduce reliance on chemical controls.",
      "HARVESTING": "Maturity: Carrots \n are typically ready for harvest 70-90 days after sowing, depending on the variety. Look for brightly colored, well-sized roots.\nHarvesting method: \n Harvest carrots by carefully loosening the soil around the roots and gently pulling them up. Avoid damaging the carrots during harvest, as injuries can lead to storage problems.\nExpected yield: \nA well-managed carrot crop in Sri Lanka can yield approximately 30-40 tons per hectare."
    },
    "SIN": {
      "SOIL": "අයිඩියල් පස: \n කාබනික ද්රව්ය වලින් පොහොසත් ලිහිල්, බදින ලද, හොඳින් ජලය බැස යන පසෙහි කැරට් වර්ධනය වේ. වැලි ලෝම හෝ ලෝම පස් වඩාත් කැමති වේ. අධික මැටි පස් මුල් වර්ධනයට බාධාවක් විය හැකි අතර, එය නොගැලපෙන හෝ කැරට් පල්වීමට හේතු වේ. හොඳින් කුණු වූ කොම්පෝස්ට් හෝ වයස්ගත පොහොර ඇතුළත් කිරීමෙන් පසෙහි ගුණාත්මකභාවය වැඩි දියුණු කරන්න.පාංශු pH අගය: කැරට් තරමක් ආම්ලික පාංශු pH අගය 6.0-6.8 අගයක් ගනී. නිර්දේශ අනුව දෙහි හෝ සල්ෆර් භාවිතා කරමින් ඔබේ පස පරීක්ෂා කර අවශ්ය නම් pH අගය සකස් කරන්න.\nකැණීම සහ පාත්ති සෑදීම: \n ඝනත්වය බිඳී සියුම් බීජ පාත්ති නිර්මාණය කිරීම සඳහා පස අවම වශයෙන් සෙන්ටිමීටර 30 ක් පමණ ගැඹුරට ගැඹුරට ගෙනයන්න. විශේෂයෙන් අධික වර්ෂාපතනයක් ඇති ප්රදේශවල ජලාපවහනය සහ වාතනය වැඩි දියුණු කිරීම සඳහා උස් ඇඳන් සකස් කරන්න",
      "PLANTING": "බීජ තෝරා ගැනීම: \n ශ්රී ලංකාවේ දේශගුණයට ගැලපෙන උසස් තත්ත්වයේ කැරට් බීජ තෝරන්න. ජනප්රිය ප්රභේද අතර 'New Kuroda', 'Nantes' සහ අනෙකුත් දේශීයව අනුවර්තනය කරන ලද වර්ග ඇතුළත් වේ. කෘෂිකර්ම දෙපාර්තමේන්තුව හෝ පිළිගත් බීජ සැපයුම්කරුවන් වැනි විශ්වාසදායක මූලාශ්රවලින් බීජ ලබා ගන්න. බීජ අනුපාතය: කැරට් සඳහා සාමාන්ය බීජ අනුපාතය හෙක්ටයාරයකට ආසන්න වශයෙන් 4 kg කි. \n රෝපණ ක්රමය: \n සෘජු වැපිරීම කැරට් සඳහා වඩාත් කැමති ක්රමයකි. සෙන්ටිමීටර 25 ක පමණ පේළි පරතරයක් පවත්වා ගනිමින් උස් පාත්ති මත පේළි වශයෙන් බීජ වපුරන්න. මූල සංවර්ධනය සඳහා ප්රමාණවත් ඉඩක් ලබා දීම සඳහා එක් එක් පේළිය තුළ සෙන්ටිමීටර 5-8 අතර පරතරයකින් පසුව ප්රවේශමෙන් තුනී බීජ පැල කරන්න.",
      "FERTILIZING": "බාසල් පොහොර: \n සිටුවීමට පෙර හොඳින් කුණු වූ කොම්පෝස්ට් හෝ පොහොර (හෙක්ටයාරයකට ටොන් 10 ක් පමණ) පසට ඇතුළත් කරන්න. TSP (Triple Superphosphate) සහ MOP (Muriate of Potash) වැනි සමතුලිත බාසල් පොහොර මිශ්රණයක් යොදන්න. ඔබේ පාංශු පරීක්ෂණ ප්රතිඵල සහ කලාපය අනුව නිශ්චිත පොහොර නිර්දේශ සඳහා කෘෂිකර්ම දෙපාර්තමේන්තුවෙන් (http://www.doa.gov.lk/) විමසන්න. \n ඉහළ ඇඳුම් ඇඳීම: \n ප්රශස්ත පෝෂක අවශෝෂණය සඳහා නයිට්රජන් පොහොර යෙදීම් වැඩෙන සමය පුරාම ඉහළ කණ්නාඩි කිහිපයකට බෙදන්න. සාමාන්ය ඉහළ ඇඳුම් ඇඳීමේ කාලසටහනකට පැළ සිටුවීමෙන් පසු සති 3, 6, 8 සහ 9 වලදී යෙදීම් ඇතුළත් විය හැකිය. ඔබේ නිශ්චිත ස්ථානය සඳහා කෘෂිකාර්මික බලධාරීන් විසින් සපයනු ලබන නිර්දේශ අනුගමනය කරන්න.",
      "RECOMMEND": "ජනප්රිය ප්රභේද: \n ශ්රී ලංකාව සඳහා හොඳින් අනුවර්තනය වූ කැරට් ප්රභේද අතරට 'නව කුරෝඩා', 'නැන්ටෙස්', 'චැන්ටේනේ' සහ 'ඩෑන්වර්ස්' ඇතුළත් වේ. මෙම ප්රභේදවල හොඳ අස්වැන්නක් ලබා ගැනීමේ හැකියාව, රෝග ප්රතිරෝධය සහ ශ්රී ලංකාවේ වගා තත්වයන්ට යෝග්ය වීම සඳහා ප්රසිද්ධය.\nකලාපීය නිර්දේශ: \n ඔබේ නිශ්චිත කලාපයට සහ වැඩෙන සමය සඳහා නිර්දේශිත හොඳම කැරට් වර්ග සඳහා කෘෂිකර්ම දෙපාර්තමේන්තුව හෝ ඔබේ ප්රාදේශීය කෘෂිකර්ම ව්යාප්ති නිලධාරීන් සමඟ සාකච්ඡා කරන්න.",
      "DISEASES": "පොදු රෝග: \n Alternaria කොළ අංගමාරය, Cercospora පත්ර ලප, කෝණාකාර සහ මුල් කුණු වීමේ රෝග වැනි දිලීර රෝග ගැන විමසිලිමත් වන්න. බැක්ටීරියා මෘදු කුණුවීම වැනි බැක්ටීරියා රෝග කැරට් වලටද බලපායි. රෝග අවදානම අවම කිරීම සඳහා බෝග මාරු කිරීම සහ නිසි සනීපාරක්ෂාව වැනි හොඳ සංස්කෘතික භාවිතයන් පුරුදු කරන්න.\nපළිබෝධ: කුඩිත්තන්, කැරට් මැස්සන්, කැපුම් පණුවන් සහ නෙමටෝඩාවන් වැනි පළිබෝධකයන් සඳහා නිරීක්ෂණය කරන්න. ඵලදායී පළිබෝධ කළමනාකරණය සඳහා සංස්කෘතික, ජීව විද්යාත්මක සහ රසායනික පාලන ක්රම ඒකාබද්ධ කරන ඒකාබද්ධ පළිබෝධ කළමනාකරණ (IPM) උපාය මාර්ග ක්රියාත්මක කරන්න.\nරසායනික පාලනය: අවශ්ය නම්, නිර්දේශිත දිලීර නාශක හෝ කෘමිනාශක උපදෙස් අනුව කල්පනාකාරීව භාවිතා කරන්න. රසායනික පාලනයන් මත යැපීම අඩු කිරීමට සෑම විටම IPM ප්රවේශයන්ට ප්රමුඛත්වය දෙන්න.",
      "HARVESTING": "තීරණාත්මක අවධීන්: \n ප්රරෝහණය සහ මුල් සංවර්ධන අවධියේදී ප්රමාණවත් තෙතමනයක් සහතික කිරීම. අඛණ්ඩව ජලය දැමීම දිගු, සෘජු සහ හොඳින් හැඩැති කැරට් සෑදීම ප්රවර්ධනය කරයි.\nවාරිමාර්ග ක්රම: \n නිතර නිතර, සැහැල්ලු වාරිමාර්ග කැරට් සඳහා සුදුසු වේ. බිංදු ජල සම්පාදනය හෝ විදින පද්ධති ප්රශස්ත පාංශු තෙතමන මට්ටම් පවත්වා ගැනීමට උපකාරී වේ. අධික ලෙස ජලය දැමීමෙන් වළකින්න, එය ජලයෙන් යටවීම හා රෝග ගැටලු ඇති විය හැක."
    },
    "TAM": {
      "SOIL": "சிறந்த மண்: \n கரிமப் பொருட்கள் நிறைந்த தளர்வான, வறுத்த, நன்கு வடிகட்டிய மண்ணில் கேரட் செழித்து வளரும். மணல் அல்லது களிமண் மண் விரும்பப்படுகிறது. கனமான களிமண் மண் வேர் வளர்ச்சியைத் தடுக்கலாம், இது கேரட் சிதைவதற்கு அல்லது குன்றிய நிலைக்கு வழிவகுக்கும். நன்கு அழுகிய உரம் அல்லது வயதான எருவை சேர்த்து மண்ணின் தரத்தை மேம்படுத்தவும். \n மண்ணின் pH: \n கேரட் சற்று அமிலத்தன்மை கொண்ட மண்ணின் pH வரம்பு 6.0-6.8 ஐ விரும்புகிறது. பரிந்துரைகளின்படி சுண்ணாம்பு அல்லது கந்தகத்தைப் பயன்படுத்தி உங்கள் மண்ணைச் சோதித்து, தேவைப்பட்டால் pH ஐ சரிசெய்யவும்.\n உழவு மற்றும் பாத்தி உருவாக்கம்:\n மண்ணை குறைந்தபட்சம் 30 செ.மீ ஆழத்திற்கு ஆழமாக உழவும். குறிப்பாக அதிக மழை பெய்யும் பகுதிகளில் வடிகால் மற்றும் காற்றோட்டத்தை மேம்படுத்த உயர்த்தப்பட்ட படுக்கைகளை தயார் செய்யவும்",
      "PLANTING": "விதை தேர்வு: \n இலங்கையின் காலநிலைக்கு ஏற்ற உயர்தர கேரட் விதைகளை தேர்வு செய்யவும். பிரபலமான வகைகளில் 'நியூ குரோடா', 'நாண்டேஸ்' மற்றும் பிற உள்நாட்டில் தழுவிய வகைகள் அடங்கும். வேளாண்மைத் துறை அல்லது புகழ்பெற்ற விதை வழங்குநர்கள் போன்ற நம்பகமான ஆதாரங்களில் இருந்து விதைகளைப் பெறுங்கள். \n விதை விகிதம்: \n கேரட்டின் வழக்கமான விதை விகிதம் ஹெக்டேருக்கு தோராயமாக 4 கிலோ ஆகும்.\n நடவு முறை:\n நேரடி விதைப்பு கேரட்டுக்கு விருப்பமான முறையாகும். உயரமான பாத்திகளில் விதைகளை வரிசையாக விதைத்து, சுமார் 25 செ.மீ வரிசை இடைவெளியை பராமரிக்கவும். ஒவ்வொரு வரிசையிலும் 5-8 செ.மீ இடைவெளியில் கவனமாக மெல்லிய நாற்றுகளை வேர் வளர்ச்சிக்கு போதுமான இடத்தை அனுமதிக்கவும்.",
      "FERTILIZING": "அடித்தள உரம்: \n நன்கு அழுகிய உரம் அல்லது உரம் (ஒரு ஹெக்டேருக்கு சுமார் 10 டன்) நடவு செய்வதற்கு முன் மண்ணில் சேர்க்கவும். டிஎஸ்பி (டிரிபிள் சூப்பர் பாஸ்பேட்) மற்றும் எம்ஓபி (முரியட் ஆஃப் பொட்டாஷ்) போன்ற சீரான அடித்தள உரக் கலவையைப் பயன்படுத்துங்கள். உங்கள் மண் பரிசோதனை முடிவுகள் மற்றும் பிராந்தியத்தின் அடிப்படையில் குறிப்பிட்ட உரப் பரிந்துரைகளுக்கு வேளாண்மைத் துறையை (http://www.doa.gov.lk/) அணுகவும். \n சிறந்த உரமிடுதல்:\n  நைட்ரஜன் உரப் பயன்பாடுகளை வளரும் பருவத்தில் பல மேல் உரங்களாகப் பிரித்து, உகந்த ஊட்டச் சத்துகளை எடுத்துக்கொள்ளவும். ஒரு பொதுவான மேல் ஆடை அட்டவணையில் நடவு செய்த 3, 6, 8 மற்றும் 9 வாரங்களில் பயன்பாடுகள் இருக்கலாம். உங்கள் குறிப்பிட்ட இடத்திற்கு விவசாய அதிகாரிகள் வழங்கிய பரிந்துரைகளைப் பின்பற்றவும்.",
      "RECOMMEND": "பிரபலமான வகைகள்: \n  இலங்கைக்கு நன்கு பொருந்திய சில கேரட் வகைகளில் 'நியூ குரோடா', 'நான்டெஸ்', 'சாண்டெனாய்' மற்றும் 'டான்வர்ஸ்' ஆகியவை அடங்கும். இந்த வகைகள் அவற்றின் நல்ல மகசூல் திறன், நோய் எதிர்ப்பு மற்றும் இலங்கையின் வளரும் நிலைமைகளுக்கு ஏற்றதாக அறியப்படுகின்றன.\nபிராந்திய பரிந்துரைகள்: \n உங்கள் குறிப்பிட்ட பகுதி மற்றும் வளரும் பருவத்திற்கு பரிந்துரைக்கப்படும் சிறந்த கேரட் வகைகளுக்கு வேளாண்மைத் துறை அல்லது உங்கள் உள்ளூர் வேளாண் விரிவாக்க அதிகாரிகளுடன் கலந்தாலோசிக்கவும்",
      "DISEASES": "பொதுவான நோய்கள்: \n ஆல்டர்னேரியா இலை கருகல் நோய், செர்கோஸ்போரா இலைப்புள்ளி, நுண்துகள் பூஞ்சை காளான் மற்றும் வேர் அழுகல் நோய்கள் போன்ற பூஞ்சை நோய்களைக் கவனியுங்கள். பாக்டீரியா மென்மையான அழுகல் போன்ற பாக்டீரியா நோய்களும் கேரட்டை பாதிக்கும். நோய் அபாயங்களைக் குறைக்க பயிர் சுழற்சி மற்றும் முறையான சுகாதாரம் போன்ற நல்ல கலாச்சார நடைமுறைகளைப் பயிற்சி செய்யுங்கள்.\nபூச்சிகள்:\n அஃபிட்ஸ், கேரட் ஈக்கள், வெட்டுப்புழுக்கள் மற்றும் நூற்புழுக்கள் போன்ற பூச்சிகளைக் கண்காணிக்கவும். பயனுள்ள பூச்சி மேலாண்மைக்கு கலாச்சார, உயிரியல் மற்றும் இரசாயன கட்டுப்பாட்டு முறைகளை இணைக்கும் ஒருங்கிணைந்த பூச்சி மேலாண்மை (IPM) உத்திகளை செயல்படுத்தவும்",
      "HARVESTING": "முக்கிய நிலைகள்: \n முளைப்பு மற்றும் வேர் வளர்ச்சியின் போது போதுமான ஈரப்பதத்தை உறுதி செய்யவும். தொடர்ச்சியான நீர்ப்பாசனம் நீண்ட, நேரான மற்றும் நன்கு வடிவ கேரட் உருவாவதை ஊக்குவிக்கிறது.\nநீர்ப்பாசன முறைகள்: \n அடிக்கடி, லேசான நீர்ப்பாசனம் கேரட்டுக்கு ஏற்றது. சொட்டு நீர் பாசனம் அல்லது தெளிப்பான் அமைப்புகள் உகந்த மண்ணின் ஈரப்பதத்தை பராமரிக்க உதவும். அதிகப்படியான நீர்ப்பாசனத்தைத் தவிர்க்கவும், இது நீர் தேங்குதல் மற்றும் நோய் சிக்கல்களுக்கு வழிவகுக்கும்."
    }
  },
  "BEETROOT": {
    "ENG": {
      "SOIL": "Ideal pH:\nBeetroot thrives in light, well-draining soil with a pH between 6.0 and 7.0.\nOrganic Matter:\nEnrich the soil with plenty of organic matter, such as compost or well-rotted manure, to provide the nutrients beetroot needs to grow.\nSoil Preparation:\nBreak up the soil to a fine tilth to ensure it's free of large clumps and stones which could hinder root development.",
      "PLANTING": "Sowing Seeds:\nDirectly sow beetroot seeds in the ground from early spring, as soon as the soil is workable, to mid-summer.\nDepth and Spacing:\nPlant seeds about 1 cm deep, in rows that are 30 cm apart.\nTemperature:\nUse a cloche or fleece if temperatures are still cool, to warm the soil and encourage germination.\nThinning Out:\nThin seedlings to leave about 10 cm between each plant once they are 2-3 cm tall.",
      "FERTILIZING": "Soil Nutrition:\nBeetroot generally does well in well-prepared soil with sufficient organic matter and may not require additional fertilizing.\nFertilizer Application:\nIf necessary, apply a light application of a balanced, organic fertilizer as the plants start to grow.",
      "RECOMMEND": "While specific varieties were not initially discussed, here are a few recommended species for diverse needs:\n'Boltardy':\nResistant to bolting and very reliable.\n'Detroit Dark Red':\nKnown for its deep red color and good flavor.\n'Chioggia':\nFeatures distinctive red and white rings inside, offering a sweet flavor and an attractive appearance.\n'Golden Beet':\nYields yellow roots that are sweet and tender, with the added benefit of not staining.",
      "DISEASES": "Common Issues:\nBeetroot is relatively resistant but watch for leaf miners and aphids.\nOrganic Management:\nUse appropriate organic methods, such as removing affected leaves or applying organic pesticides, to manage any infestations.\nPreventative Measures:\nRegularly check plants and maintain good garden hygiene to prevent the onset of diseases.",
      "HARVESTING": "When to Harvest:\nHarvest beetroot when the roots are about the size of a golf ball or larger, typically 7-10 weeks after planting.\nOvergrown Roots:\nAvoid leaving beetroot in the ground too long as they may become tough and woody.\nContinuous Harvest:\nFor a continuous supply, consider succession planting every 2-3 weeks up until two months before the first expected fall frost."
    },
    "SIN": {
      "SOIL": "කදිම pH අගය: \nබීට්රූට් 6.0 සහ 7.0 අතර pH අගයක් සහිත සැහැල්ලු, හොඳින් ජලය බැස යන පසෙහි වර්ධනය වේ.\nකාබනික ද්‍රව්‍ය: \nබීට්රූට් වර්ධනයට අවශ්‍ය පෝෂ්‍ය පදාර්ථ ලබා දීම සඳහා කොම්පෝස්ට් හෝ හොඳින් කුණු වූ පොහොර වැනි කාබනික ද්‍රව්‍ය බහුල ලෙස පස පොහොසත් කරන්න.\nපාංශු සකස් කිරීම: \nමුල් වර්ධනයට බාධාවක් විය හැකි විශාල ගැටිති සහ ගල් වලින් තොර බව සහතික කිරීම සඳහා පස සියුම් ඇලයකට කඩා දමන්න.",
      "PLANTING": "බීජ වැපිරීම: \nපස වැඩ කළ හැකි ඉක්මනින්, ගිම්හානයේ මැද භාගය දක්වා මුල් වසන්තයේ සිට බිමෙහි බීට්රූට් බීජ කෙලින්ම වපුරන්න.\nගැඹුර සහ පරතරය: \nසෙන්ටිමීටර 1 ක් පමණ ගැඹුරට, සෙන්ටිමීටර 30 ක පරතරයකින් යුත් පේළිවල බීජ සිටුවන්න.\nඋෂ්ණත්වය: \nපස උණුසුම් කිරීමට සහ ප්‍රරෝහණය දිරිමත් කිරීමට, උෂ්ණත්වය තවමත් සිසිල් නම්, ලොම් හෝ ලොම් භාවිතා කරන්න.",
      "FERTILIZING": "පාංශු පෝෂණය: \nබීට්රූට් සාමාන්‍යයෙන් ප්‍රමාණවත් කාබනික ද්‍රව්‍ය සහිත හොඳින් සකස් කළ පසෙහි හොඳින් ක්‍රියා කරන අතර අමතර පොහොර අවශ්‍ය නොවේ.\nපොහොර යෙදීම: \nඅවශ්‍ය නම්, ශාක වර්ධනය වීමට පටන් ගන්නා විට සමතුලිත කාබනික පොහොර සැහැල්ලුවෙන් යොදන්න.",
      "RECOMMEND": "නිශ්චිත ප්‍රභේද මුලින් සාකච්ඡා නොකළ නමුත්, විවිධ අවශ්‍යතා සඳහා නිර්දේශිත විශේෂ කිහිපයක් මෙන්න:\n'බෝල්ටාර්ඩි': \nබෝල්ටින් වලට ප්‍රතිරෝධී සහ ඉතා විශ්වාසදායකය.\n'ඩිට්රොයිට් තද රතු': \nඑහි තද රතු පැහැය සහ හොඳ රසය සඳහා ප්රසිද්ධය.\n' චියෝගියා ': \nඇතුළත සුවිශේෂී රතු සහ සුදු වළලු, මිහිරි රසයක් සහ ආකර්ෂණීය පෙනුමක් ලබා දෙයි.\n'ගෝල්ඩන් බීට්': \nපැල්ලම් නොකිරීමේ අමතර ප්‍රතිලාභ සමඟ පැණිරස හා මුදු මොළොක් කහ මුල් ලබා දෙයි.",
      "DISEASES": "පොදු ගැටළු: \nබීට්රූට් සාපේක්ෂව ප්රතිරෝධී නමුත් කොළ පතල්කරුවන් සහ කුඩිත්තන් සඳහා නිරීක්ෂණය කරන්න.\nකාබනික කළමනාකරණය: \nඕනෑම ආසාදනයක් කළමනාකරණය කිරීම සඳහා බලපෑමට ලක් වූ කොළ ඉවත් කිරීම හෝ කාබනික පළිබෝධනාශක යෙදීම වැනි සුදුසු කාබනික ක්‍රම භාවිතා කරන්න.\nවැළැක්වීමේ පියවර: \nරෝග ඇතිවීම වැළැක්වීම සඳහා නිතිපතා ශාක පරීක්ෂා කිරීම සහ හොඳ ගෙවතු සනීපාරක්ෂාව පවත්වා ගැනීම.",
      "HARVESTING": "අස්වැන්න නෙළන විට: \nසාමාන්‍යයෙන් සිටුවීමෙන් සති 7-10 කට පසු, මුල් ගොල්ෆ් බෝලයක් හෝ ඊට වඩා විශාල වන විට බීට්රූට් අස්වැන්න නෙළා ගන්න.\nදත මුල්: \nබීට්රූට් දැඩි හා දැවමය බවට පත් විය හැකි බැවින් වැඩි වේලාවක් බිම තැබීමෙන් වළකින්න.\nඅඛණ්ඩ අස්වැන්න: \nඅඛණ්ඩ සැපයුමක් සඳහා, පළමු අපේක්ෂිත වැටීමට මාස දෙකකට පෙර සිට සති 2-3 කට වරක් අනුප්‍රාප්තික රෝපණ සලකා බලන්න."
    },
    "TAM": {
      "SOIL": "சிறந்த pH: \nபீட்ரூட் 6.0 மற்றும் 7.0 இடையே pH உடன் ஒளி, நன்கு வடிகட்டிய மண்ணில் செழித்து வளரும்.\nகரிமப் பொருட்கள்: \nபீட்ரூட் வளரத் தேவையான ஊட்டச்சத்துக்களை வழங்க, உரம் அல்லது நன்கு அழுகிய உரம் போன்ற ஏராளமான கரிமப் பொருட்களால் மண்ணை வளப்படுத்தவும்.\nமண் தயாரித்தல்: \nவேர் வளர்ச்சியைத் தடுக்கக்கூடிய பெரிய கொத்துக்கள் மற்றும் கற்கள் இல்லாமல் இருப்பதை உறுதிசெய்ய, மண்ணை நன்றாக சாய்வாக உடைக்கவும்.",
      "PLANTING": "விதை தேர்வு: \n இலங்கையின் காலநிலைக்கு ஏற்ற உயர்தர கேரட் விதைகளை தேர்வு செய்யவும். பிரபலமான வகைகளில் 'நியூ குரோடா', 'நாண்டேஸ்' மற்றும் பிற உள்நாட்டில் தழுவிய வகைகள் அடங்கும். வேளாண்மைத் துறை அல்லது புகழ்பெற்ற விதை வழங்குநர்கள் போன்ற நம்பகமான ஆதாரங்களில் இருந்து விதைகளைப் பெறுங்கள். \n விதை விகிதம்: \n கேரட்டின் வழக்கமான விதை விகிதம் ஹெக்டேருக்கு தோராயமாக 4 கிலோ ஆகும்.\n நடவு முறை:\n நேரடி விதைப்பு கேரட்டுக்கு விருப்பமான முறையாகும். உயரமான பாத்திகளில் விதைகளை வரிசையாக விதைத்து, சுமார் 25 செ.மீ வரிசை இடைவெளியை பராமரிக்கவும். ஒவ்வொரு வரிசையிலும் 5-8 செ.மீ இடைவெளியில் கவனமாக மெல்லிய நாற்றுகளை வேர் வளர்ச்சிக்கு போதுமான இடத்தை அனுமதிக்கவும்.",
      "FERTILIZING": "மண் ஊட்டச்சத்து: \nபீட்ரூட் பொதுவாக போதுமான கரிமப் பொருட்களுடன் நன்கு தயாரிக்கப்பட்ட மண்ணில் நன்றாகச் செயல்படுகிறது மேலும் கூடுதல் உரமிடுதல் தேவையில்லை.\nஉரப் பயன்பாடு: \nதேவைப்பட்டால், தாவரங்கள் வளரத் தொடங்கும் போது, ஒரு சீரான, கரிம உரத்தை லேசாகப் பயன்படுத்துங்கள்.",
      "RECOMMEND": "குறிப்பிட்ட வகைகள் ஆரம்பத்தில் விவாதிக்கப்படவில்லை என்றாலும், பல்வேறு தேவைகளுக்கு சில பரிந்துரைக்கப்பட்ட இனங்கள் இங்கே:\n'போல்டார்டி': \nபோல்டிங்கிற்கு எதிர்ப்பு மற்றும் மிகவும் நம்பகமானது.\n'டெட்ராய்ட் டார்க் ரெட்': \nஅடர் சிவப்பு நிறம் மற்றும் நல்ல சுவைக்கு பெயர் பெற்றது.\n'சியோஜியா': \nஉள்ளே தனித்துவமான சிவப்பு மற்றும் வெள்ளை வளையங்கள், இனிமையான சுவை மற்றும் கவர்ச்சிகரமான தோற்றத்தை வழங்குகிறது.\n'கோல்டன் பீட்': \nகறை படியாத கூடுதல் நன்மையுடன், இனிப்பு மற்றும் மென்மையான மஞ்சள் வேர்களை விளைவிக்கிறது.",
      "DISEASES": "பொதுவான சிக்கல்கள்: \nபீட்ரூட் ஒப்பீட்டளவில் எதிர்ப்புத் திறன் கொண்டது, ஆனால் இலை சுரங்கத் தொழிலாளர்கள் மற்றும் அசுவினிகளைப் பார்க்கவும்.\nகரிம மேலாண்மை: \nபாதிக்கப்பட்ட இலைகளை அகற்றுதல் அல்லது கரிம பூச்சிக்கொல்லிகளைப் பயன்படுத்துதல் போன்ற பொருத்தமான கரிம முறைகளைப் பயன்படுத்தி, ஏதேனும் தொற்றுநோய்களை நிர்வகிக்கவும்.\nதடுப்பு நடவடிக்கைகள்: \nநோய்கள் வராமல் தடுக்க தாவரங்களை தவறாமல் பரிசோதித்து, நல்ல தோட்ட சுகாதாரத்தை பராமரிக்கவும்.",
      "HARVESTING": "எப்போது அறுவடை செய்ய வேண்டும்: \nபொதுவாக நடவு செய்த 7-10 வாரங்களுக்குப் பிறகு, வேர்கள் கோல்ஃப் பந்தின் அளவு அல்லது பெரியதாக இருக்கும் போது பீட்ரூட்டை அறுவடை செய்யவும்.\nஅதிகமாக வளர்ந்த வேர்கள்: \nபீட்ரூட்டை அதிக நேரம் தரையில் விடுவதைத் தவிர்க்கவும், ஏனெனில் அவை கடினமாகவும் மரமாகவும் மாறும்.\nதொடர்ச்சியான அறுவடை: \nதொடர்ச்சியான சப்ளைக்கு, முதல் எதிர்பார்க்கப்படும் உறைபனிக்கு இரண்டு மாதங்களுக்கு முன்பு வரை ஒவ்வொரு 2-3 வாரங்களுக்கும் அடுத்தடுத்து நடவு செய்ய வேண்டும்."
    }
  }
}
